app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles" ORDER BY "profiles"."first_name" ASC
---
  def index
    path = request.url
    if path.include? "unit"
      @unit = params[:unit]
      @unitname = @units[params[:unit].to_sym]
      @allunit = Profile.where(unit: @unit)
      @heads = @allunit.where(opt_in: true).order(:last_name)
      @staff = @allunit.where(opt_in: nil).order(:last_name)
      @profiles = @heads + @staff
    elsif path.include? "building"
      @building = params[:building]
      @buildingname = @buildings[params[:building].to_sym]
      @profiles = Profile.where("campus_address=?", params[:building]).order(:first_name)
    else
      @profiles = Profile.order(:first_name)

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 504], ["LIMIT", 1]]
---
  def show
    @profile = Profile.friendly.find(params[:id])